<a href="https://colab.research.google.com/github/afzal101/Learnings/blob/main/python_practise.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
#!pip install pandas
import pandas as pd
#GHNA0602109234b
import numpy as np

In [1]:
print('hello world')

hello world

## Tiger

In [ ]:
# Define the dictionary with the data
data = {
    "Product": ["Product A", "Product B", "Product C", "Product D"],
    "Q1_Sales": [150, 200, 300, 250],
    "Q2_Sales": [180, 220, 310, 270],
    "Q3_Sales": [210, 250, 330, 290],
    "Q4_Sales": [240, 280, 350, 310]
}

# Create a DataFrame from the dictionary
df = pd.DataFrame(data)

unp_df = df.melt(id_vars='Product', value_vars=['Q1_Sales', 'Q2_Sales', 'Q3_Sales', 'Q4_Sales'])
unp_df

new_df= unp_df.groupby(['Product', 'variable'])['value'].sum().reset_index()

In [ ]:
quarter_sales=df.iloc[:,1:].sum()
max_quarter= quarter_sales.idxmax()
max_sales=quarter_sales.max()
max_quarter
print(quarter_sales)
print(max_quarter)
print(max_sales)

q_sales = new_df.groupby('variable')['value'].sum().reset_index()
#display(q_sales)##
q_sales.loc[q_sales['value'].idxmax(), 'variable']

p_df = new_df.groupby('Product')['value'].sum().reset_index()
p_df.loc[3,'Product']

In [ ]:
data = {
    "Name": ["John", "Sarah", "Mike", "Lisa", "Tom"],
    "Age": [28, 32, 40, 25, 35],
    "Income": [50000, 65000, 80000, 45000, 70000]
}

df = pd.DataFrame(data)

In [ ]:
df['Rule'] = np.where(df['Income']<=50000, 'Less',
                      np.where((df['Income']>50000) & (df['Income']<=70000), 'Medium','High'))

In [ ]:
#df.drop(columns =['Ruchckle'])
df.columns = df.columns.str.lower()

In [ ]:
str1= "You can reach out to John at john.doe@example.com, Sarah at sarah123@email.com, or Mike at mike.work@company.org for further details."
l1 =[]
l2 =[]

l1 = str1.split()
print(l1)
for i in range(0, len(l1)):
    if '@' in l1[i]:
        l2.append(l1[i])
l2

['You', 'can', 'reach', 'out', 'to', 'John', 'at', 'john.doe@example.com,', 'Sarah', 'at', 'sarah123@email.com,', 'or', 'Mike', 'at', 'mike.work@company.org', 'for', 'further', 'details.']

['john.doe@example.com,', 'sarah123@email.com,', 'mike.work@company.org']

In [ ]:
my_t = (1,2,3,4)
new_t = (5,'afz')
my_t = my_t+new_t
my_t

key = {1,2,3,'afz'}
key

str1 = 'Hello Word'
l1 =[]
l1 = str1.split()
l1 = l1[::-1]
b = ' '.join(l1)
b

'Word Hello'

genrators /decorators/ iterator
list compression within a function
leet code
fibonacci
palindrome

In [ ]:
#write a function that takes a list and a new list with duplicated removed while preserving the original order

def remove_duplicates(lst):
    seen = []
    unique_list = []

    for item in lst:
        if item not in seen:
            unique_list.append(item)
            seen.append(item)

    return unique_list
original_list = ([1, 2, 3, 2, 4, 1, 5, 6, 3, 7])
new_list = remove_duplicates(original_list)

print(new_list)
original_list = ([1, 2, 3, 2, 4, 1, 5, ])

[1, 2, 3, 4, 5, 6, 7]

In [ ]:
a =  "afzal mohammed"
l1 = a.split()
l2=[]
for i in l1:
    b = len(i)
    l2.append(b)
l2
dic = dict(zip(l1, l2))
print(dic)
my_d= {}
for i in range(len(l2)):
    my_d[l1[i]]=l2[i]
my_d

{'afzal': 5, 'mohammed': 8}

{'afzal': 5, 'mohammed': 8}

In [ ]:
def number_generator():
    for i in range(1, 6):
        yield i  # Returns one number at a time

gen = number_generator()

print(next(gen))  # Output: 1
print(next(gen))
print(next(gen))

1
2
3

In [ ]:
l= [2,5,4,5,1,6,6]
l.sort(reverse= True)
l[1]
# max_first = l[0]
# for i in l:
#     if i>max_first:
#         max_first =i
# max_first
# second_max= None
# for i in l:
#     if i != max_first:
#         if second_max is None or  i>second_max:
#             second_max=i
# second_max
first_max= l[0]
for i in l:
    if i >first_max:
        first_max = i
second_max = None
for i in l:
    if i!=first_max:
        if second_max is None or i>second_max:
            second_max= i
second_max

5

In [ ]:
def are_strings_matching_loop(s1, s2):
    if len(s1) != len(s2):  # If lengths are different, they can't match
        return False

    char_count1 = {}  # Dictionary to store frequency of s1
    char_count2 = {}  # Dictionary to store frequency of s2

    for char in s1:
        char_count1[char] = char_count1.get(char, 0) + 1

    # Count character frequencies for s2
    for char in s2:
        char_count2[char] = char_count2.get(char, 0) + 1

    return char_count1 == char_count2

# Example
s1 = "aabbcc"
s2 = "baccab"
print(are_strings_matching_loop(s1, s2))  # Output: True

s3 = "abc"
s4 = "abcd"
print(are_strings_matching_loop(s3, s4))  # Output: False

{'a': 2, 'b': 2, 'c': 2}
{'b': 2, 'a': 2, 'c': 2}
True
False

In [ ]:
a ='afza'
b ='afza'

if len(a)==len(b):
    char1={}
    char2={}
    for i in a:
        char1[i]= char1.get(i,0)+1
    for j in b:
        char2[j] = char2.get(j,0)+1

print( char1==char2)

True

In [ ]:
b='samee'
c = 'eeams'
if len(b)== len(c):
    char1={}
    char2={}
    for i in b:
        char1[i]=char1.get(i,0)+1
    for j in c:
        char2[j]=char2.get(j,0)+1
print(char1==char2)

True

In [ ]:
data = {'values': [10, 20, 30, 40, 50, 60, 70, 80]}
df = pd.DataFrame(data)
df['rolling_mean'] = df['values'].rolling(window=2).mean()
df

   values  rolling_mean
0      10           NaN
1      20          15.0
2      30          25.0
3      40          35.0
4      50          45.0
5      60          55.0
6      70          65.0
7      80          75.0

In [ ]:
import pandas as pd

# def detect_duplicates(df, subset=None):
#     df["is_duplicate"] = df.duplicated(subset=subset, keep=False)  # Mark all duplicates
#     return df
def detect_dupl(df, subset):
    df['is_duplicated'] =df.duplicated(subset)
    return df
# Example Data
data = {
    'ID': [1, 2, 3, 4, 5, 6,7],
    'Name': ['Alice', 'Bob', 'Charlie', 'Alice', None, 'Alice', 'Alice'],
    'Age': [25, 30, 35, 25, 25, None, None]
}

df = pd.DataFrame(data)
result = detect_dupl(df, subset=['Name', 'Age'])
result = detect_duplicates(df, subset=['Name', 'Age'])
print(result)

   ID     Name   Age  is_duplicated  is_duplicate
0   1    Alice  25.0          False          True
1   2      Bob  30.0          False         False
2   3  Charlie  35.0          False         False
3   4    Alice  25.0           True          True
4   5     None  25.0          False         False
5   6    Alice   NaN          False          True
6   7    Alice   NaN           True          True

In [ ]:
import numpy as np
q1 = np.percentile(df['amoun'], 0.25)
q2= np.percentile(df['amount'], 0.75)
iqr = q3-q1
lower_bound = q1-irq*1.5
upper_bound = q3+1.5*iqr
df['outliers']= [(df['amount']<lower_bound) | (df['amoun']>upper_bound)]

In [ ]:
def longest_string(str1):
    b = str1.split()
    long= b[0]
    for i in b:
        if len(i)>len(long):
            long =i
    second_long = None
    for j in b:
        if second_long== None or len(j)>len(long):
            second_long=j
    return second_long
    return long

str1 = 'AFzal mohammed   in love with sameera'
print(longest_string(str1))

AFzal

In [ ]:

data = {
    "brand": ["A", "B", "C", "D", "E", "A", "B", "C", "D", "E"],
    "year": [2023, 2023, 2023, 2023, 2023, 2024, 2024, 2024, 2024, 2024],
    "week": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10],
    "sales_unit": [500, 600, 700, 20000, 800, 900, 1000, 1200, 150, 200],  # Outlier at 20000
    "avg_price": [10, 12, 11, 9, 50, 10, 11, 12, 1000, 9],  # Outlier at 1000
    "digital": [2000, 2500, np.nan, 3000, 3500, 4000, 4500, np.nan, 5000, 5500],  # Null values
    "media": [500, 700, 600, 800, np.nan, 900, 1000, 1100, 1200, 1300],  # Null value
    "ooh": [100, 200, 300, 400, 500, 600, np.nan, 800, 900, 1000],  # Null value
    "TV": [5000, 6000, 7000, 8000, 9000, 10000, np.nan, 12000, 13000, 14000],  # Null value
    "print": [50, 60, 70, 80, 90, 100, 110, 120, np.nan, 140],  # Null value
}

# Create DataFrame
df = pd.DataFrame(data)

In [ ]:
df1= df.groupby(['brand','year'])['sales_unit'].sum().reset_index()
df1[(df1['year']== 2022) | (df1['year']== 2023)]

  brand  year  sales_unit
0     A  2023         500
2     B  2023         600
4     C  2023         700
6     D  2023       20000
8     E  2023         800

In [ ]:
df1['prev_sales'] = df1.groupby('brand')['sales_unit'].shift(1)
df1

  brand  year  sales_unit  prev_sales
0     A  2023         500         NaN
1     A  2024         900       500.0
2     B  2023         600         NaN
3     B  2024        1000       600.0
4     C  2023         700         NaN
5     C  2024        1200       700.0
6     D  2023       20000         NaN
7     D  2024         150     20000.0
8     E  2023         800         NaN
9     E  2024         200       800.0

In [ ]:
df1= df1.dropna()
df1['yoy']=(df1['sales_unit']-df1['prev_sales'])*100/df1['prev_sales']
df1

C:\Users\Haseeba Syed\AppData\Local\Temp\ipykernel_6908\427493810.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df1['yoy']=(df1['sales_unit']-df1['prev_sales'])*100/df1['prev_sales']

  brand  year  sales_unit  prev_sales        yoy
1     A  2024         900       500.0  80.000000
3     B  2024        1000       600.0  66.666667
5     C  2024        1200       700.0  71.428571
7     D  2024         150     20000.0 -99.250000
9     E  2024         200       800.0 -75.000000

In [ ]:
missing_summary = df.isnull().sum().reset_index()
missing_summary.columns = ['Column', 'Missing Values']
missing_summary['Percentage'] = (missing_summary['Missing Values'] / len(df)) * 100

print(missing_summary)

       Column  Missing Values  Percentage
0       brand               0         0.0
1        year               0         0.0
2        week               0         0.0
3  sales_unit               0         0.0
4   avg_price               0         0.0
5     digital               2        20.0
6       media               1        10.0
7         ooh               1        10.0
8          TV               1        10.0
9       print               1        10.0

In [ ]:
# Calculate threshold (50% of total rows)
threshold = len(df) * 0.5

df_cleaned = df.dropna(axis=1, thresh=threshold)

print(df_cleaned.head())

  brand  year  week  sales_unit  avg_price  digital  media    ooh      TV  \
0     A  2023     1         500         10   2000.0  500.0  100.0  5000.0
1     B  2023     2         600         12   2500.0  700.0  200.0  6000.0
2     C  2023     3         700         11      NaN  600.0  300.0  7000.0
3     D  2023     4       20000          9   3000.0  800.0  400.0  8000.0
4     E  2023     5         800         50   3500.0    NaN  500.0  9000.0

   print
0   50.0
1   60.0
2   70.0
3   80.0
4   90.0

In [ ]:
df

,brand,year,week,sales_unit,avg_price,digital,media,ooh,TV,print
0,A,2023,1,500,10,2000.0,500.0,100.0,5000.0,50.0
1,B,2023,2,600,12,2500.0,700.0,200.0,6000.0,60.0
2,C,2023,3,700,11,NaN,600.0,300.0,7000.0,70.0
3,D,2023,4,20000,9,3000.0,800.0,400.0,8000.0,80.0
4,E,2023,5,800,50,3500.0,NaN,500.0,9000.0,90.0
5,A,2024,6,900,10,4000.0,900.0,600.0,10000.0,100.0
6,B,2024,7,1000,11,4500.0,1000.0,NaN,NaN,110.0
7,C,2024,8,1200,12,NaN,1100.0,800.0,12000.0,120.0
8,D,2024,9,150,1000,5000.0,1200.0,900.0,13000.0,NaN
9,E,2024,10,200,9,5500.0,1300.0,1000.0,14000.0,140.0

In [ ]:
cols_to_drop = df.columns[df.isnull().mean() >0.5]
df_cl= df.drop(columns =cols_to_drop)
df_cl
df

,brand,year,week,sales_unit,avg_price,digital,media,ooh,TV,print
0,A,2023,1,500,10,2000.0,500.0,100.0,5000.0,50.0
1,B,2023,2,600,12,2500.0,700.0,200.0,6000.0,60.0
2,C,2023,3,700,11,NaN,600.0,300.0,7000.0,70.0
3,D,2023,4,20000,9,3000.0,800.0,400.0,8000.0,80.0
4,E,2023,5,800,50,3500.0,NaN,500.0,9000.0,90.0
5,A,2024,6,900,10,4000.0,900.0,600.0,10000.0,100.0
6,B,2024,7,1000,11,4500.0,1000.0,NaN,NaN,110.0
7,C,2024,8,1200,12,NaN,1100.0,800.0,12000.0,120.0
8,D,2024,9,150,1000,5000.0,1200.0,900.0,13000.0,NaN
9,E,2024,10,200,9,5500.0,1300.0,1000.0,14000.0,140.0

### product of lists

In [ ]:
l1 =[1,2,3,5,6]
out = l1[0]
for i in l1:
    out=out*i
out

l2=[]
for i in range(len(l1)):
    product =1
    for  j in range(len(l1)):
        if i!=j:
            product *= l1[j]
    l2.append(product)

l2

[180, 90, 60, 36, 30]